'''2. А және В екі бүтін сандар берілген.
 А<B болса, өсу ретімен немесе басқаша жағдайда кему ретімен
  А-дан В-ға дейінгі барлық сандарды басып шығарыңыз.
Даны два целых числа A и В.
Выведите все числа от A до B включительно,
 в порядке возрастания, если A < B,
 или в порядке убывания в противном случае.'''

a = int(input())
b = int(input())
if a < b:
    for i in range(a, b + 1):
        print(i)
else:
    for i in range(a, b - 1, -1):
        print(i)