'''3. Екі бүтін А және В саны берілген,
 A>B. А-дан В-ға дейінгі барлық тақ сандарды кему ретімен басып шығарыңыз.
 Бұл тапсырмада if операторынсыз орындай аласыз.
Даны два целых числа A и В, A>B.
 Выведите все нечётные числа от A до B включительно,
  в порядке убывания. В этой задаче можно обойтись без инструкции if.'''

a = int(input())
b = int(input())
for i in range(a - (a + 1) % 2, b - b % 2, -2):
    print(i, end=' ')