#Ержанова Алмаш
#3лаб
#циклдарды қолданып жеке программа құру
'''total = 100

i = 0
while i < 5:
    n = int(input())
    total = total - n
    i = i + 1

print("Осталось", total)'''



'''пример на random'''
'''import random

city_list = ['New York', 'Los Angeles', 'Chicago', 'Houston', 'Philadelphia']
print("Выбор случайного города из списка - ", random.choice(city_list))'''



'''range() функциясын қолданып тізім жасау. 
range() функциясына әртүрлі типтегі мәндерді еңгізіп.
 әртүрлі мысалдар арқылы нәтижесін экранға шығару'''
'''from itertools import chain
merged = chain(range(5), range(10, 15))
for it in merged:
  print(it, end = ", ")'''



'''1. Екі бүтін А және В саны берілген (А ≤ B бар). 
А-дан В-ға дейінгі барлық сандарды басып шығарыңыз.
Даны два целых числа A и B (при этом A ≤ B).
 Выведите все числа от A до B включительно.'''
a = int(input())
b = int(input())
for i in range(a, b):
  print(i)



'''2. А және В екі бүтін сандар берілген.
 А<B болса, өсу ретімен немесе басқаша жағдайда кему ретімен
  А-дан В-ға дейінгі барлық сандарды басып шығарыңыз.
Даны два целых числа A и В. 
Выведите все числа от A до B включительно,
 в порядке возрастания, если A < B, 
 или в порядке убывания в противном случае.'''
'''a = int(input())
b = int(input())
if a < b:
    for i in range(a, b + 1):
        print(i)
else:
    for i in range(a, b - 1, -1):
        print(i)'''



'''3. Екі бүтін А және В саны берілген,
 A>B. А-дан В-ға дейінгі барлық тақ сандарды кему ретімен басып шығарыңыз. 
 Бұл тапсырмада if операторынсыз орындай аласыз.
Даны два целых числа A и В, A>B.
 Выведите все нечётные числа от A до B включительно,
  в порядке убывания. В этой задаче можно обойтись без инструкции if.'''
'''a = int(input())
b = int(input())
for i in range(a - (a + 1) % 2, b - b % 2, -2):
    print(i, end=' ')'''



'''4. Үстел ойыны үшін 1-ден N-ге дейінгі сандары бар карталар пайдаланылады.
Бір карта жоғалады. Қалған карталардың сандарын білу арқылы оны табыңыз.
N саны берілген, содан кейін N − 1 қалған карталардың саны (1-ден N-ге дейінгі әртүрлі сандар).
 Бағдарлама жоғалған картаның нөмірін көрсетуі керек.
Для настольной игры используются карточки с номерами от 1 до N. 
Одна карточка потерялась. Найдите ее, зная номера оставшихся карточек.
Дано число N, далее N − 1 номер оставшихся карточек (различные числа от 1 до N).
 Программа должна вывести номер потерянной карточки.
Для самых умных: массивами и аналогичными структурами данных пользоваться нельзя.'''
'''n = int(input())
sum = 0
for i in range(1, n + 1):
    sum += i
for i in range(n - 1):
    sum -= int(input())
print(sum)'''